Revit 2015 API
BehaviorType Enumeration
 An enumerated type listing all the behavior type for MEP Components.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public enum BehaviorType
Visual Basic
Public Enumeration BehaviorType
Visual C++
public enum class BehaviorType
Members
Member name | Description
Invalid |  BehaviorType is Invalid
Normal |  BehaviorType is Normal
Bend |  BehaviorType is Bend
Branch |  BehaviorType is Branch
Intersection |  BehaviorType is Intersection
Inline |  BehaviorType is Inline
BreakInto |  BehaviorType is Break Into
OrientToObject |  BehaviorType is Orient to Object
OrientToCenterLine |  BehaviorType is Orient to CenterLine
OrientToFace |  BehaviorType is Orient to Face
SystemMember |  BehaviorType is System Member
BaseObject |  BehaviorType is Base Object
EndCap |  BehaviorType is End Cap
Valve |  BehaviorType is Valve
Flange |  BehaviorType is Flange
MechanicalCoupling |  BehaviorType is Mechanical Coupling
VerticalBend |  BehaviorType is Vertical Bend
ElectricalBaseObject |  BehaviorType is Electrical Base Object
See Also
Autodesk.Revit.DB Namespace